W6D4/app/controllers/artwork_shares_controller.rb

  def create
    share = ArtworkShare.new(artwork_share_params)
    if share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 1], ["created_at", "2019-11-22 00:26:14.832415"], ["updated_at", "2019-11-22 00:26:14.832415"]]

  def destroy
    share = ArtworkShare.find_by(id: params[:id])
    if share
      share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]