W6D4/app/controllers/users_controller.rb

  def update
    user = User.find_by(id: params[:id])
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "askdjfsafasfasasc"], ["updated_at", "2019-11-21 00:26:49.244201"], ["id", 3]]

  def destroy
    user = User.find_by(id: params[:id])
    user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]